<?php

namespace App\Constant;

use App\Models\User;

class App
{
const DISTRICT_SELECT = [

    /* ນະຄອນຫຼວງວຽງຈັນ ມີ 09 ເມືອງ */
    'ຈັນທະບູລີ'           => 'ຈັນທະບູລີ',
    'ສີໂຄດຕະບອງ'        => 'ສີໂຄດຕະບອງ',
    'ໄຊເສດຖາ'           => 'ໄຊເສດຖາ',
    'ສີສະຕະນາກ'         => 'ສີສະຕະນາກ',
    'ນາຊາຍທອງ'         => 'ນາຊາຍທອງ',
    'ໄຊທານີ'            => 'ໄຊທານີ',
    'ຫາດຊາຍຟອງ'       => 'ຫາດຊາຍຟອງ',
    'ສັງທອງ'            => 'ສັງທອງ',
    'ປາກງື່ມ'            => 'ປາກງື່ມ',

    /* ຜົ້ງສາລີ ມີ 07 ເມືອງ */
    'ຜົ້ງສາລີ'             => 'ຜົ້ງສາລີ',
    'ໃໝ່'               => 'ໃໝ່',
    'ຂວາ'               => 'ຂວາ',
    'ສຳພັນ'              => 'ສຳພັນ ',
    'ບູນເໜືອ'             => 'ບູນເໜືອ',
    'ຍອດອູ'               => 'ຍອດອູ',
    'ບູນໃຕ້'               => 'ບູນໃຕ້',


    /* ຫຼວງນ້ຳທາ ມີ 05 ເມືອງ */
    'ຫຼວງນ້ຳທາ'           => 'ຫຼວງນ້ຳທາ',
    'ສິງ'                => 'ສິງ',
    'ລອງ'               => 'ລອງ',
    'ວຽງພູຄາ'            => 'ວຽງພູຄາ',
    'ນາແລ'              => 'ນາແລ',


    /* ອຸດົມໄຊ ມີ 07 ເມືອງ */
    'ໄຊ'                    => 'ໄຊ',
    'ຫລາ'                   => 'ຫລາ',
    'ນາໝໍ້'                  => 'ນາໝໍ້',
    'ງາ'                    => 'ງາ ',
    'ແບງ'                   => 'ແບງ',
    'ຮູນ'                    => 'ຮູນ',
    'ປາກແບ່ງ'                => 'ປາກແບ່ງ',

    /* ບໍ່ແກ້ວ ມີ 05 ເມືອງ */
    'ຫ້ວຍຊາຍ'           => 'ຫ້ວຍຊາຍ',
    'ຕົ້ນເຜີ້ງ'            => 'ຕົ້ນເຜີ້ງ',
    'ເມິງ'               => 'ເມິງ',
    'ຜາອຸດົມ'            => 'ຜາອຸດົມ',
    'ປາກທາ'            => 'ປາກທາ',


    /* ຫລວງພະບາງ ມີ 12 ເມືອງ */
    'ຫລວງພະບາງ'         => 'ຫລວງພະບາງ',
    'ຊຽງເງິນ'             => 'ຊຽງເງິນ',
    'ນານ'               => 'ນານ',
    'ປາກອູ'              => 'ປາກອູ ',
    'ນ້ຳບາກ'             => 'ນ້ຳບາກ',
    'ງອຍ'               => 'ງອຍ',
    'ປາກແຊງ'            => 'ປາກແຊງ',
    'ໂພນໄຊ'             => 'ໂພນໄຊ',
    'ຈອມເພັດ'           => 'ຈອມເພັດ',
    'ວຽງຄຳ'             => 'ວຽງຄຳ',
    'ພູຄູນ'              => 'ພູຄູນ ',
    'ໂພນທອງ'           => 'ໂພນທອງ ',

    /* ຫົວພັນ ມີ 08 ເມືອງ */
    'ຊຳເໜືອ'              => 'ຊຳເໜືອ',
    'ຊຽງຄໍ້'                => 'ຊຽງຄໍ້',
    'ວຽງທອງ'              => 'ວຽງທອງ',
    'ວຽງໄຊ'               => 'ວຽງໄຊ',
    'ຫົວເມືອງ'             => 'ຫົວເມືອງ',
    'ຊຳໃຕ້'                => 'ຊຳໃຕ້',
    'ສົບເບົາ'               => 'ສົບເບົາ',
    'ແອດ'                => 'ແອດ',


    /* ໄຊຍະບູລີ ມີ 11 ເມືອງ*/
    'ໄຊຍະບູລີ'                 => 'ໄຊຍະບູລີ',
    'ຄອບ'                    => 'ຄອບ',
    'ຫົງສາ'                   => 'ຫົງສາ',
    'ເງີນ'                    => 'ເງີນ ',
    'ຊຽງຮອນ'                 => 'ຊຽງຮອນ',
    'ພຽງ'                    => 'ພຽງ',
    'ປາກລາຍ'                 => 'ປາກລາຍ',
    'ແກ່ນທ້າວ'                => 'ແກ່ນທ້າວ ',
    'ບໍ່ແຕນ'                  => 'ບໍ່ແຕນ',
    'ທົ່ງມີໄຊ'                  => 'ທົ່ງມີໄຊ',
    'ໄຊສະຖານ'                => 'ໄຊສະຖານ',

      /* ຊຽງຂວາງ ມີ 07 ເມືອງ*/
    'ແປກ'                 => 'ແປກ',
    'ຄຳ'                   => 'ຄຳ',
    'ໜອງແຮດ'             => 'ໜອງແຮດ',
    'ຄູນ'                   => 'ຄູນ  ',
    'ໝອກ'                 => 'ໝອກ',
    'ພູກູດ'                  => 'ພູກູດ',
    'ຜາໄຊ'                 => 'ຜາໄຊ',


    /* ວຽງຈັນ ມີ 13 ເມືອງ */
    'ໂພນໂຮງ '           => 'ໂພນໂຮງ',
    'ທຸລະຄົມ'             => 'ທຸລະຄົມ',
    'ແກ້ວອຸດົມ'           => 'ແກ້ວອຸດົມ',
    'ກາສີ'               => 'ກາສີ',
    'ວັງວຽງ'              => 'ວັງວຽງ',
    'ເຟືອງ '             => 'ເຟືອງ ',
    'ຊະນະຄາມ'           => 'ຊະນະຄາມ',
    'ແມດ'              => 'ແມດ',
    'ວຽງຄຳ'             => 'ວຽງຄຳ',
    'ຫີນເຫີບ '           => 'ຫີນເຫີບ ',
    'ຮົ່ມ'               => 'ຮົ່ມ',
    'ໄຊສົມບູນ'           => 'ໄຊສົມບູນ',
    'ມື່ນ'               => 'ມື່ນ',


    /* ບໍລິຄຳໄຊ ມີ 06 ເມືອງ */
    'ປາກຊັນ'             => 'ປາກຊັນ',
    'ທ່າພະບາດ'            => 'ທ່າພະບາດ',
    'ປາກກະດິງ'            => 'ປາກກະດິງ',
    'ບໍລິຄັນ'              => 'ບໍລິຄັນ ',
    'ຄຳເກີດ'              => 'ຄຳເກີດ',
    'ວຽງທອງ'             => 'ວຽງທອງ',


    /* ຄຳມ່ວນ ມີ 10 ເມືອງ */
    'ທ່າແຂກ'                => 'ທ່າແຂກ',
    'ມະຫາໄຊ'                => 'ມະຫາໄຊ',
    'ຫນອງບົກ'               => 'ຫນອງບົກ',
    'ຫີນບູນ'                 => 'ຫີນບູນ',
    'ຍົມມະລາດ'              => 'ຍົມມະລາດ',
    'ບົວລະພາ'               => 'ບົວລະພາ',
    'ນາກາຍ'                => 'ນາກາຍ',
    'ເຊບັ້ງໄຟ'                => 'ເຊບັ້ງໄຟ',
    'ໄຊບົວທອງ'              => 'ໄຊບົວທອງ',
    'ຄູນຄຳ'                 => 'ຄູນຄຳ',


    /* ສະຫວັນນະເຂດ ມີ 15 ເມືອງ */
    'ໄກສອນພົມວິຫານ '          => 'ໄກສອນພົມວິຫານ ',
    'ອຸທຸມພອນ'                => 'ອຸທຸມພອນ',
    'ອາດສະພັງທອງ'             => 'ອາດສະພັງທອງ',
    'ພີນ'                     => 'ພີນ ',
    'ເຊໂປນ'                   => 'ເຊໂປນ',
    'ນອງ'                    => 'ນອງ',
    'ທ່າປາງທອງ'                => 'ທ່າປາງທອງ',
    'ສອງຄອນ '                => 'ສອງຄອນ ',
    'ຈຳພອນ'                  => 'ຈຳພອນ',
    'ຊົນບູລີ'                   => 'ຊົນບູລີ',
    'ໄຊບູລີ'                    => 'ໄຊບູລີ ',
    'ວິລະບູລີ'                   => 'ວິລະບູລີ',
    'ອາດສະພອນ'               => 'ອາດສະພອນ',
    'ໄຊພູທອງ'                  => 'ໄຊພູທອງ',
    'ພະລານໄຊ '                => 'ພະລານໄຊ',


    /* ສາລະວັນ ມີ 08 ເມືອງ */
    'ສາລະວັນ'           => 'ສາລະວັນ',
    'ຕະໂອ້ຍ'            => 'ຕະໂອ້ຍ',
    'ຕຸ້ມລານ'            => 'ຕຸ້ມລານ',
    'ລະຄອນເພັງ'          => 'ລະຄອນເພັງ',
    'ວາປີ'               => 'ວາປີ',
    'ຄົງເຊໂດນ'            => 'ຄົງເຊໂດນ',
    'ເລົ່າງາມ'             => 'ເລົ່າງາມ',
    'ສະໝ້ວຍ'            => 'ສະໝ້ວຍ',


    /* ເຊກອງ ມີ 04 ເມືອງ */
    'ລະມາມ'             => 'ລະມາມ',
    'ກະລືມ'              => 'ກະລືມ',
    'ດາກຈຶງ'              => 'ດາກຈຶງ',
    'ທ່າແຕງ'             => 'ທ່າແຕງ ',

    /* ຈຳປາສັກ ມີ 10 ເມືອງ */
    'ປາກເຊ'                => 'ປາກເຊ',
    'ຊະນະສົມບູນ'            => 'ຊະນະສົມບູນ',
    'ບາຈຽງຈະເລີນສຸກ'         => 'ບາຈຽງຈະເລີນສຸກ',
    'ປາກຊ່ອງ'               => 'ປາກຊ່ອງ',
    'ປະທຸມພອນ'             => 'ປະທຸມພອນ',
    'ໂພນທອງ'               => 'ໂພນທອງ',
    'ຈຳປາສັກ'               => 'ຈຳປາສັກ',
    'ສຸຂຸມາ'                 => 'ສຸຂຸມາ',
    'ມຸນລະປາໂມກ'            => 'ມຸນລະປາໂມກ',
    'ໂຂງ'                   => 'ໂຂງ',

    /* ອັດຕະປື ມີ 05 ເມືອງ */
    'ໄຊເສດຖາ'                => 'ໄຊເສດຖາ',
    'ສາມັກຄີໄຊ'                => 'ສາມັກຄີໄຊ',
    'ສະໜາມໄຊ'               => 'ສະໜາມໄຊ',
    'ຊານໄຊ'                  => 'ຊານໄຊ',
    'ພູວົງ'                   => 'ພູວົງ',

      /* ໄຊສົມບູນມີ 07 ເມືອງ*/
    'ອະນຸວົງ'                => 'ອະນຸວົງ',
    'ລ້ອງແຈ້ງ'               => 'ລ້ອງແຈ້ງ',
    'ລ້ອງຊານ'               => 'ລ້ອງຊານ',
    'ຮົ່ມ'                   => 'ຮົ່ມ  ',
    'ທ່າໂທມ'                => 'ທ່າໂທມ',
    ];


const PROVINCE_SELECT = [
    'ອັດຕະປື'                 => 'ອັດຕະປື',
    'ບໍ່ແກ້ວ'                  => 'ບໍ່ແກ້ວ',
    'ບໍລິຄຳໄຊ'                 => 'ບໍລິຄຳໄຊ',
    'ຈຳປາສັກ'                 => 'ຈຳປາສັກ',
    'ຫົວພັນ'                  => 'ຫົວພັນ',
    'ຄຳມ່ວນ'                  => 'ຄຳມ່ວນ',
    'ຫຼວງນ້ຳທາ'                => 'ຫຼວງນ້ຳທາ',
    'ຫຼວງພະບາງ'               => 'ຫຼວງພະບາງ',
    'ອຸດົມໄຊ'                  => 'ອຸດົມໄຊ',
    'ພົງສາລີ'                  => 'ພົງສາລີ',
    'ສາລະວັນ'                 => 'ສາລະວັນ',
    'ສະຫວັນນະເຂດ'             => 'ສະຫວັນນະເຂດ',
    'ນະຄອນຫຼວງວຽງຈັນ'          => 'ນະຄອນຫຼວງວຽງຈັນ',
    'ວຽງຈັນ'                   => 'ວຽງຈັນ',
    'ໄຊຍະບູລີ'                  => 'ໄຊຍະບູລີ',
    'ເຊກອງ'                   => 'ເຊກອງ',
    'ໄຊສົມບູນ'                  => 'ໄຊສົມບູນ',
    'ຊຽງຂວາງ'                  => 'ຊຽງຂວາງ',
    ];

const GENDER_RADIO = [
    'ພຣະ'               => 'ພຣະ',
    'ສ.ນ'               => 'ສ.ນ',
    'ຊາຍ'               => 'ຊາຍ',
    'ຍິງ'                => 'ຍິງ',
    ];

const RELIGION_SELECT = [
    'ພຸດ'                 => 'ພຸດ',
    'ຄຣິສ'                => 'ຄຣິສ',
    'ອິສລາມ'              => 'ອິສລາມ',
    'ຮິນດູ'                => 'ຮິນດູ',
    'ອື່ນໆ'                => 'ອື່ນໆ',
    'ບໍ່ມີ'                 => 'ບໍ່ມີ',
    ];
}
